
Процедура ОКНажатие(Элемент)
	ЭтаФорма.Закрыть();
КонецПроцедуры

Процедура Надпись3Нажатие(Элемент)
	ЗапуститьПриложение("http://www.infostart.ru/profile/48623/");
КонецПроцедуры

Процедура Надпись4Нажатие(Элемент)
	ЗапуститьПриложение("http://nashe1c.ru/users/Yaroslav_Volohov/materials/");
КонецПроцедуры

Процедура ПриОткрытии()
	Текст = 
	"Предоставляю услуги по дистанционной разработке в среде " + 
	"1С Предприятия 8.х и 7.7: создание конфигураций 'с нуля', " +
	"доработка существующих конфигураций, написание отчетов, обработок, " +
	"перенос данных, интеграция с другими информационными системами. " +
	Символы.ПС +
	"Помогу обучиться программированию на языке 1С 8 и 7.7, " +
	"подготовится к сертификации фирмы 1С (есть опыт и необходимые материалы)." 
	+ Символы.ПС + Символы.ПС +
	"E-mail: xcom84@ukr.net " + Символы.ПС +
	"ICQ: 570606344 " + Символы.ПС + 
	"Телефон: 80984226858 (по Украине)";
КонецПроцедуры
