 // ++ Ситис: p.virich   2018-07-08
Функция ЭтоРабочаяБаза() Экспорт
	
	Если Врег(ПолучитьИмяИнформационнойБазы() )= Врег(СокрЛП(Константы.c_ИмяРабочейБазы.Получить())) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
Конецфункции  // -- Ситис: p.virich   2018-07-08 
 
// ++ Ситис: p.virich   2018-07-08
 Функция ПолучитьИмяИнформационнойБазы() Экспорт

    СтрокаПодключения = СтрокаСоединенияИнформационнойБазы();

    НомерСимвола = СтрНайти(СтрокаПодключения,"File=");
    Если НомерСимвола > 0 Тогда
        //Это Файловая база
        СтрокаСправа = Сред(СтрокаПодключения,НомерСимвола+6);
        Возврат Сред(СтрокаСправа,1,СтрДлина(СтрокаСправа)-2);
    КонецЕсли;

    НомерСимвола = СтрНайти(СтрокаПодключения,"Ref=");
    Если НомерСимвола > 0 Тогда
        //Это серверная база
        СтрокаСправа = Сред(СтрокаПодключения,НомерСимвола+5);
        Возврат Сред(СтрокаСправа,1,СтрДлина(СтрокаСправа)-2);
    КонецЕсли;

    Возврат "";

Конецфункции // -- Ситис: p.virich   2018-07-08 

&НаСервере
Процедура ВыполнениеИнициализацииСервер() Экспорт 
	
	Если РольДоступна("ПолныеПрава") Тогда
		Обработки.с_ИнициализацияЗначений.ВыполнениеИнициализации();	
	КонецЕсли;
	
 КонецПроцедуры

