
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Построитель.АвтоДетальныеЗаписи = (ДетальныеЗаписи=0);
	Если ДетальныеЗаписи=1 Тогда
		Построитель.ВыводитьДетальныеЗаписи = Истина;
	ИначеЕсли ДетальныеЗаписи=2 Тогда
		Построитель.ВыводитьДетальныеЗаписи = Ложь;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Построитель, ЭтаФорма, "ВыводитьЗаголовокОтчета,ВыводитьОбщиеИтоги,ВыводитьПодвалОтчета,ВыводитьПодвалТаблицы,ВыводитьШапкуТаблицы,ОбрабатыватьПрерываниеПользователя,ОтображатьСостояние,ТекстЗаголовка");
	
	Построитель.ЗаполнениеРасшифровки = 
	?(ЗаполнениеРасшифровки=0, ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок,
	?(ЗаполнениеРасшифровки=1, ВидЗаполненияРасшифровкиПостроителяОтчета.Расшифровка,
	ВидЗаполненияРасшифровкиПостроителяОтчета.НеЗаполнять));
	
	Построитель.РазмещениеИзмеренийВКолонках = 
	?(РазмещениеИзмеренийВКолонках=0, ТипРазмещенияИзмерений.Вместе,
	?(РазмещениеИзмеренийВКолонках=1, ТипРазмещенияИзмерений.Отдельно,
	 РазмещениеИзмеренийВКолонках.ОтдельноИТолькоВИтогах));

	Построитель.РазмещениеИзмеренийВСтроках =
	?(РазмещениеИзмеренийВСтроках=0, ТипРазмещенияИзмерений.Вместе,
	?(РазмещениеИзмеренийВСтроках=1, ТипРазмещенияИзмерений.Отдельно,
	 РазмещениеИзмеренийВСтроках.ОтдельноИТолькоВИтогах));

	Построитель.РазмещениеИтоговВКолонках = 
	?(РазмещениеИтоговВКолонках=0, ТипРазмещенияИтогов.Заголовок,
	?(РазмещениеИтоговВКолонках=1, ТипРазмещенияИтогов.Подвал,
	?(РазмещениеИтоговВКолонках=2, ТипРазмещенияИтогов.ЗаголовокИПодвал,
	ТипРазмещенияИтогов.ТолькоПодвал)));

	Построитель.РазмещениеИтоговВСтроках =
	?(РазмещениеИтоговВСтроках=0, ТипРазмещенияИтогов.Заголовок,
	?(РазмещениеИтоговВСтроках=1, ТипРазмещенияИтогов.Подвал,
	?(РазмещениеИтоговВСтроках=2, ТипРазмещенияИтогов.ЗаголовокИПодвал,
	ТипРазмещенияИтогов.ТолькоПодвал)));

	Построитель.РазмещениеРеквизитовИзмеренийВКолонках = 
	?(РазмещениеРеквизитовИзмеренийВКолонках=0, ТипРазмещенияРеквизитовИзмерений.Отдельно,
	?(РазмещениеРеквизитовИзмеренийВКолонках=1, ТипРазмещенияРеквизитовИзмерений.Вместе,
	ТипРазмещенияРеквизитовИзмерений.ВместеСИзмерениями));
	Построитель.РазмещениеРеквизитовИзмеренийВСтроках =
	?(РазмещениеРеквизитовИзмеренийВСтроках=0, ТипРазмещенияРеквизитовИзмерений.Отдельно,
	?(РазмещениеРеквизитовИзмеренийВСтроках=1, ТипРазмещенияРеквизитовИзмерений.Вместе,
	ТипРазмещенияРеквизитовИзмерений.ВместеСИзмерениями));
	
	Закрыть(Истина);
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭлементыФормы.РазмещениеИзмеренийВСтроках.СписокВыбора = ЭлементыФормы.РазмещениеИзмеренийВКолонках.СписокВыбора;
	ЭлементыФормы.РазмещениеИтоговВСтроках.СписокВыбора = ЭлементыФормы.РазмещениеИтоговВКолонках.СписокВыбора;
	ЭлементыФормы.РазмещениеРеквизитовИзмеренийВСтроках.СписокВыбора = ЭлементыФормы.РазмещениеРеквизитовИзмеренийВКолонках.СписокВыбора;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Построитель, "ВыводитьЗаголовокОтчета,ВыводитьОбщиеИтоги,ВыводитьПодвалОтчета,ВыводитьПодвалТаблицы,ВыводитьШапкуТаблицы,ОбрабатыватьПрерываниеПользователя,ОтображатьСостояние,ТекстЗаголовка");
	
	ДетальныеЗаписи = ?(Построитель.АвтоДетальныеЗаписи, 0, ?(Построитель.ВыводитьДетальныеЗаписи, 1, 2));
	
	ЗаполнениеРасшифровки = 
	?(Построитель.ЗаполнениеРасшифровки=ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок, 0,
	?(Построитель.ЗаполнениеРасшифровки=ВидЗаполненияРасшифровкиПостроителяОтчета.Расшифровка, 1,
	2));
	
	РазмещениеИзмеренийВКолонках = 
	?(Построитель.РазмещениеИзмеренийВКолонках=ТипРазмещенияИзмерений.Вместе, 0,
	?(Построитель.РазмещениеИзмеренийВКолонках=ТипРазмещенияИзмерений.Отдельно, 1,
	 2));

	РазмещениеИзмеренийВСтроках =
	?(Построитель.РазмещениеИзмеренийВСтроках=ТипРазмещенияИзмерений.Вместе, 0,
	?(Построитель.РазмещениеИзмеренийВСтроках=ТипРазмещенияИзмерений.Отдельно, 1,
	 2));

	РазмещениеИтоговВКолонках = 
	?(Построитель.РазмещениеИтоговВКолонках=ТипРазмещенияИтогов.Заголовок, 0,
	?(Построитель.РазмещениеИтоговВКолонках=ТипРазмещенияИтогов.Подвал, 1,
	?(Построитель.РазмещениеИтоговВКолонках=ТипРазмещенияИтогов.ЗаголовокИПодвал, 2,
	3)));

	РазмещениеИтоговВСтроках =
	?(Построитель.РазмещениеИтоговВСтроках=ТипРазмещенияИтогов.Заголовок, 0,
	?(Построитель.РазмещениеИтоговВСтроках=ТипРазмещенияИтогов.Подвал, 1,
	?(Построитель.РазмещениеИтоговВСтроках=ТипРазмещенияИтогов.ЗаголовокИПодвал, 2,
	3)));

	РазмещениеРеквизитовИзмеренийВКолонках = 
	?(Построитель.РазмещениеРеквизитовИзмеренийВКолонках=ТипРазмещенияРеквизитовИзмерений.Отдельно, 0,
	?(Построитель.РазмещениеРеквизитовИзмеренийВКолонках=ТипРазмещенияРеквизитовИзмерений.Вместе, 1,
	2));
	
	РазмещениеРеквизитовИзмеренийВСтроках =
	?(Построитель.РазмещениеРеквизитовИзмеренийВСтроках=ТипРазмещенияРеквизитовИзмерений.Отдельно, 0,
	?(Построитель.РазмещениеРеквизитовИзмеренийВСтроках=ТипРазмещенияРеквизитовИзмерений.Вместе, 1,
	2));
КонецПроцедуры
