
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	ПереченьНеРаспределенныхПозицийИнициализация();

КонецПроцедуры

Процедура ПриЗакрытии()

	СохранитьЗначение("НастройкаВнешниеОтчетыПереченьНеРаспределенныхПозицийПереченьНеРаспределенныхПозиций_6921b400-5d61-40fc-a362-7d55add672a1", ПостроительОтчетаПереченьНеРаспределенныхПозиций.ПолучитьНастройки());

КонецПроцедуры

Процедура ДействияФормыПереченьНеРаспределенныхПозицийНастройка(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_НАСТРОЙКА(ПереченьНеРаспределенныхПозиций)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Форма = ВнешнийОтчетОбъект.ПолучитьФорму("ПереченьНеРаспределенныхПозицийНастройка");
	Форма.ПостроительОтчета = ПостроительОтчетаПереченьНеРаспределенныхПозиций;
	Настройка = ПостроительОтчетаПереченьНеРаспределенныхПозиций.ПолучитьНастройки();
	Если Форма.ОткрытьМодально() = Истина Тогда
		ПереченьНеРаспределенныхПозицийВывести();
	Иначе
		ПостроительОтчетаПереченьНеРаспределенныхПозиций.УстановитьНастройки(Настройка);
	КонецЕсли;

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_НАСТРОЙКА
КонецПроцедуры

Процедура ДействияФормыПереченьНеРаспределенныхПозицийСформировать(Кнопка)
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА(ПереченьНеРаспределенныхПозиций)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ПереченьНеРаспределенныхПозицийВывести();

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПРОЦЕДУРА_ВЫЗОВА
КонецПроцедуры

Процедура ПереченьНеРаспределенныхПозицийВывести()
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ВЫПОЛНИТЬ(ПереченьНеРаспределенныхПозиций)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ЭлементыФормы.ПолеТабличногоДокумента.Очистить();

	ПостроительОтчетаПереченьНеРаспределенныхПозиций.Параметры.Вставить("Период", НачалоМесяца(Период));

	ПостроительОтчетаПереченьНеРаспределенныхПозиций.Выполнить();
	ПостроительОтчетаПереченьНеРаспределенныхПозиций.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	ПостроительОтчетаПереченьНеРаспределенныхПозиций.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	ПостроительОтчетаПереченьНеРаспределенныхПозиций.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	ПостроительОтчетаПереченьНеРаспределенныхПозиций.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Дерево);
	ПостроительОтчетаПереченьНеРаспределенныхПозиций.Вывести(ЭлементыФормы.ПолеТабличногоДокумента);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ВЫПОЛНИТЬ
КонецПроцедуры

Процедура ПереченьНеРаспределенныхПозицийИнициализация()
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ИНИЦИАЛИЗАЦИЯ(ПереченьНеРаспределенныхПозиций)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	ПостроительОтчетаПереченьНеРаспределенныхПозиций.Текст =
	"ВЫБРАТЬ
	|	РаспределениеЗатратПоПеределамОрганизаций.Затрата.Артикул КАК Артикул,
	|	РаспределениеЗатратПоПеределамОрганизаций.Затрата КАК Затрата,
	|	РаспределениеЗатратПоПеределамОрганизаций.Подразделение,
	|	РаспределениеЗатратПоПеределамОрганизаций.НоменклатурнаяГруппа
	|ИЗ
	|	РегистрСведений.РаспределениеЗатратПоПеределамОрганизаций КАК РаспределениеЗатратПоПеределамОрганизаций
	|ГДЕ
	|	РаспределениеЗатратПоПеределамОрганизаций.Период = &Период
	|	И РаспределениеЗатратПоПеределамОрганизаций.НомерПередела = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределениеЗатратПоПеределамОрганизаций.Затрата,
	|	РаспределениеЗатратПоПеределамОрганизаций.Затрата.Артикул,
	|	РаспределениеЗатратПоПеределамОрганизаций.Подразделение,
	|	РаспределениеЗатратПоПеределамОрганизаций.НоменклатурнаяГруппа
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Затрата)
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	Затрата.*}";
	ПостроительОтчетаПереченьНеРаспределенныхПозиций.ЗаполнитьНастройки();
	ПостроительОтчетаПереченьНеРаспределенныхПозиций.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ПостроительОтчетаПереченьНеРаспределенныхПозиций.ТекстЗаголовка = "Перечень не распределенных позиций";
	Настройка = ВосстановитьЗначение("НастройкаВнешниеОтчетыПереченьНеРаспределенныхПозицийПереченьНеРаспределенныхПозиций_6921b400-5d61-40fc-a362-7d55add672a1");
	Если Настройка <> Неопределено Тогда
		ПостроительОтчетаПереченьНеРаспределенныхПозиций.УстановитьНастройки(Настройка);
	КонецЕсли;

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ_ПОСТРОИТЕЛЬОТЧЕТА_ИНИЦИАЛИЗАЦИЯ
КонецПроцедуры

