
//ПолучитьСуммуЧиселВыделеннойОбласти() - получает сумму чисел выделенной области
//Параметры:
//ТабДок - Табличный документ
//Возвращает: Число - Сумму чисел области
Функция ПолучитьСуммуЧиселВыделеннойОбластиТабДок(ТабДок) Экспорт
	
	ОбщСумма = 0; КолЯчеекВВыделении = 0; СтрокаРезСумма = "";
	
	Для Каждого ВыделеннаяОбласть Из ТабДок.ВыделенныеОбласти Цикл //Получим и обойдем все выделенные области
		Сумма = 0;
		Для ЯчВерт = ВыделеннаяОбласть.Верх По ВыделеннаяОбласть.Низ Цикл
			Для ЯчГориз = ВыделеннаяОбласть.Лево По ВыделеннаяОбласть.Право Цикл
				ОдиночнаяОбласть = ТабДок.Область(ЯчВерт,ЯчГориз,ЯчВерт,ЯчГориз);
				//Если это число сумируем
				Сумма = Сумма+_РаспознатьЧислоВСтроке(ОдиночнаяОбласть.Текст);
			КонецЦикла;
		КонецЦикла;
		ОбщСумма = ОбщСумма + Сумма;
		СтрокаРезСумма = ?(Сумма > 0, " +","") + Сумма + СтрокаРезСумма;
	КонецЦикла;
	
	Если ТабДок.ВыделенныеОбласти.Количество() > 1 Тогда
		СтрокаРезСумма = Прав(СтрокаРезСумма,СтрДлина(СтрокаРезСумма)-1)+" = "+ОбщСумма;
	КонецЕсли;
	
	Возврат СтрокаРезСумма;
	
КонецФункции

//ПолучитьЧислоЯчеекВыделеннойОбластиТабДок() - получает сумму чисел выделенной области
//Параметры:
//ТабДок - Табличный документ
//Возвращает: Число - Количество ячеек в выделении
Функция ПолучитьЧислоЯчеекВыделеннойОбластиТабДок(ТабДок) Экспорт
	
	КолЯчеекВВыделении = 0;
	Для Каждого ВыделеннаяОбласть Из ТабДок.ВыделенныеОбласти Цикл //Получим и обойдем все выделенные области
		КолСтрок = ВыделеннаяОбласть.Низ-ВыделеннаяОбласть.Верх+1;
		КолКолонок = ВыделеннаяОбласть.Право-ВыделеннаяОбласть.Лево+1;
		КолЯчеекВОбласти = КолСтрок*КолКолонок;
		КолЯчеекВВыделении = КолЯчеекВВыделении+КолЯчеекВОбласти;
	КонецЦикла;
	
	Возврат КолЯчеекВВыделении;
	
КонецФункции

//_РаспознатьЧислоВСтроке - Полчает число из строки например '10ка' вернет 10
//Параметры:
//Текст - Текст который преобразуется в строку
//Возвращает: Число которое получено из строки
Функция _РаспознатьЧислоВСтроке(Текст) Экспорт
	
	Попытка
		
		РезЧисло = Число(Текст);
		
	Исключение
		
		РезЧисло = 0;
		
	КонецПопытки;
	
	Возврат РезЧисло;
	
КонецФункции
