&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбрабатыватьВТранзакции = Параметры.ОбрабатыватьВТранзакции;
	ИспользоватьРежимЗагрузкиОбменаДанными = Параметры.ИспользоватьРежимЗагрузкиОбменаДанными;
	КоличествоОбъектовНаТранзакцию = Параметры.КоличествоОбъектовНаТранзакцию;
	НеПрерыватьВыполнениеПриОшибке = Параметры.НеПрерыватьВыполнениеПриОшибке;
	РежимРаботы = ?(Параметры.РежимРаботы, 1, 0);
	Элементы.ГруппаКоличествоОбъектов.Доступность = ОбрабатыватьВТранзакции;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбрабатыватьВТранзакцииПриИзменении(Элемент)
	
	Элементы.ГруппаКоличествоОбъектов.Доступность = ОбрабатыватьВТранзакции;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ОбрабатыватьВТранзакции", ОбрабатыватьВТранзакции);
	СтруктураВозврата.Вставить("КоличествоОбъектовНаТранзакцию", КоличествоОбъектовНаТранзакцию);
	СтруктураВозврата.Вставить("ИспользоватьРежимЗагрузкиОбменаДанными", ИспользоватьРежимЗагрузкиОбменаДанными);
	СтруктураВозврата.Вставить("РежимРаботы", ?(РежимРаботы = 0, Ложь, Истина));
	СтруктураВозврата.Вставить("НеПрерыватьВыполнениеПриОшибке", НеПрерыватьВыполнениеПриОшибке);
	Оповестить("ИзменениеНастроекУниверсальныйПодбор", СтруктураВозврата, ЭтаФорма);
	Закрыть();
	
КонецПроцедуры