
Процедура Кнопка1Нажатие(Элемент)
	ПолучитьФорму("ФормаИзменениеКонстант").Открыть();
КонецПроцедуры

Процедура Кнопка2Нажатие(Элемент)
	ОткрытьМакет("ПоискИЗаменаЗначений");
КонецПроцедуры

Процедура Кнопка3Нажатие(Элемент)
	ПолучитьФорму("ФормаОтчетПоРолям").Открыть();
КонецПроцедуры

Процедура Кнопка4Нажатие(Элемент)
	ПолучитьФорму("ФормаКонсольЗапросов").Открыть();
КонецПроцедуры

Процедура Кнопка5Нажатие(Элемент)
	ПолучитьФорму("ФормаУдалениеПомеченныхОбъектов").Открыть();
КонецПроцедуры

Процедура Кнопка6Нажатие(Элемент)
	ОткрытьМакет("КонсольЗаданий");
КонецПроцедуры

Процедура Кнопка7Нажатие(Элемент)
	ОткрытьМакет("СтруктураХраненияБазыДанных","erf");
КонецПроцедуры

Процедура Кнопка8Нажатие(Элемент)
	ОткрытьМакет("СравнениеРолей","erf");
КонецПроцедуры

Процедура Кнопка9Нажатие(Элемент)
	ОткрытьМакет("ОбновлениеНумерацииОбъектов","epf");
КонецПроцедуры

Процедура Кнопка10Нажатие(Элемент)
	ОткрытьМакет("ОчисткаРегистровСведений","epf");
КонецПроцедуры
