
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	 ТЗ = ТаблицаРезультата.Выгрузить();
     СтандартнаяОбработка = Ложь;
	 
	     ТЗОбъектов = ТаблицаТиповОбъектов.Выгрузить();
		 ТЗПрофилей = ТаблицаПрофилей.Выгрузить();

	  //ТЗ = Новый ТаблицаЗначений;
	  //ТЗ.Колонки.Добавить("ИмяОбъекта");
	  //ТЗ.Колонки.Добавить("Роль");
	  //ТЗ.Колонки.Добавить("Право");
	  // ТЗ.Колонки.Добавить("РЛС");
                            
    //Связь между таблицей значений и именами в СКД 
    ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("НаборДанных1", ТЗ);
	ВнешниеНаборыДанных.Вставить("НаборДанных2", ТЗОбъектов);
	ВнешниеНаборыДанных.Вставить("НаборПрофилей", ТЗПрофилей);
     
    //Макет компоновки 
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
     
    //Компоновка данных 
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
     
    //Вывод результата 
    ДокументРезультат.Очистить();
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры
