
  // ++ Ситис: p.virich   2018-07-08
Функция ПолучитьНастройку(Настройка, Период = Неопределено, Организация=Неопределено, ВернутьБулево=Ложь) Экспорт

	Перем РезультатФункции;
 	
	Запрос			= Новый Запрос;

	Запрос.УстановитьПараметр("Настройка", Настройка);
	Запрос.УстановитьПараметр("Период" , Период);		
	
	ЗапросТекст	= "ВЫБРАТЬ
	           	  |	с_Настройки.Значение КАК Значение
	           	  |ИЗ
	           	  |	РегистрСведений.с_Настройки.СрезПоследних(
	           	  |			&Период,
	           	  |			Настройка = &Настройка
	           	  |				И 1 = 1) КАК с_Настройки
	           	  |
	           	  |УПОРЯДОЧИТЬ ПО
	           	  |	с_Настройки.Организация";    	
	
	
	Если Организация <> Неопределено Тогда
		Запрос.УстановитьПараметр("Организация" , Организация);		
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "1 = 1", "Организация = &Организация");
	КонецЕсли;    	

	Запрос.Текст = ЗапросТекст;

	Результат		= Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		
		Если ВернутьБулево Тогда
			РезультатФункции =  Ложь;
 		КонецЕсли;
		
	Иначе
		
		Выборка		= Результат.Выбрать();
		Выборка.Следующий();
		Значение	= Выборка.Значение;
		
		Если ВернутьБулево Тогда
			
			Если ТипЗнч(Значение)=Тип("Булево") Тогда
				РезультатФункции = Значение;
			Иначе
				РезультатФункции = ЗначениеЗаполнено(Значение);
			КонецЕсли;
			
		Иначе
			
			РезультатФункции =  Значение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Возврат РезультатФункции;
	
КонецФункции  // -- Ситис: p.virich   2018-07-08 
