 //Перем НаборЗаписей_КонтактнаяИнформация;

Функция Печать(ТабДокумент = Неопределено) Экспорт
	// Сделать печатную форму
	Если ТабДокумент = Неопределено Тогда 
		ТабДокумент = Новый ТабличныйДокумент;
	КонецЕсли;
	ТабДокумент.Очистить();
	
	Документ = СсылкаНаОбъект.ПолучитьОбъект();
	Дата  =  СсылкаНаОбъект.Дата;
	НазваниеМакета = "Доверенность";
	ВидОперации = СсылкаНаОбъект.ВидОперации;
	// ========================================================================
	 	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент", 	СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ДатаСреза",			Дата);
	
	Запрос.УстановитьПараметр("Руководитель",	  Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер", Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запрос.УстановитьПараметр("ДатаДокумента",			Дата);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Доверенность.Дата КАК ДатаДокумента,
	|	Доверенность.Организация,
	|	Доверенность.Организация.ЮрФизЛицо Как ЮрФизЛицо,
	|	Доверенность.ФизЛицо,
	|	Доверенность.ФизЛицо.Представление КАК КомуВыдана,
	|	Доверенность.Контрагент КАК Поставщик,
	|	Доверенность.НаПолучениеОт КАК ПоставщикПредставление,
	|	Доверенность.ДатаДействия,
	|	Доверенность.ПоДокументу,
	|	Доверенность.БанковскийСчетОрганизации.Банк КАК БанкОрганизации,
	|	Доверенность.БанковскийСчетОрганизации.НомерСчета КАК НомерРасчетногоСчетаОрганизации,
	|	Доверенность.БанковскийСчетОрганизации.Банк.Код КАК МФОБанкаОрганизации,
	
	|	ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.Должность.Наименование КАК ДолжностьРуководителя,
	|	ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.Должность.Наименование,
	|	ВЫБОР КОГДА (ФИОФизЛицСрезПоследнихРуководитель.ФизЛицо) ЕСТЬ NULL  ТОГДА ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.ФизическоеЛицо.Наименование ИНАЧЕ ФИОФизЛицСрезПоследнихРуководитель.Фамилия + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Имя, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Имя, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Отчество, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Отчество, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ КОНЕЦ КАК ФИОРуководителя,
	|	ВЫБОР КОГДА (ФИОФизЛицСрезПоследнихГлБух.ФизЛицо) ЕСТЬ NULL  ТОГДА ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.ФизическоеЛицо.Наименование ИНАЧЕ ФИОФизЛицСрезПоследнихГлБух.Фамилия + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Имя, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Имя, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ + ВЫБОР КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Отчество, 1, 1) <> """" ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Отчество, 1, 1) + ""."" ИНАЧЕ """" КОНЕЦ КОНЕЦ КАК ФИОГлБуха

	|ИЗ
	|	Документ.Доверенность КАК Доверенность
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &Руководитель) КАК ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследнихРуководитель
	|			ПО ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.ФизическоеЛицо = ФИОФизЛицСрезПоследнихРуководитель.ФизЛицо
	|		ПО Доверенность.Организация = ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.СтруктурнаяЕдиница
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛицаОрганизацийСрезПоследнихГлБух
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследнихГлБух
	|			ПО ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.ФизическоеЛицо = ФИОФизЛицСрезПоследнихГлБух.ФизЛицо
	|		ПО Доверенность.Организация = ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.СтруктурнаяЕдиница
	
	|ГДЕ
	|	Доверенность.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НомерСтроки              КАК Номер,
	|	НаименованиеТовара       КАК Ценности,
	|	ЕдиницаПоКлассификатору.Представление КАК ЕдиницаИзмерения,
	|	Количество
	|ИЗ
	|	Документ.Доверенность.Товары КАК Доверенность
	|ГДЕ
	|	Доверенность.Ссылка = &ТекущийДокумент	
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер
	|";
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

	//бДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Доверенность_Бланк";
	
	Если НазваниеМакета = "ДоверенностьБланк" Тогда
		Макет = ПолучитьОбщийМакет(НазваниеМакета);
	Иначе
		Макет = ПолучитьМакет(НазваниеМакета);
	КонецЕсли;
	
	ДанныеСотрудника     = ОбщегоНазначения.ДанныеФизЛица(Шапка.Организация, Шапка.ФизЛицо, Шапка.ДатаДокумента);
	ФамилияИмяОтчествоДоверенного = ?(ДанныеСотрудника.Фамилия = Неопределено,"",ДанныеСотрудника.Фамилия + " ") + 
									?(ДанныеСотрудника.Имя = Неопределено,"",ДанныеСотрудника.Имя + " ") +
									?(ДанныеСотрудника.Отчество = Неопределено,"",ДанныеСотрудника.Отчество);
									
	ДолжностьДоверенного = НРег(СокрЛП(ДанныеСотрудника.Должность));
	
	// печать производится на языке ИБ
	
	КодЯзыкаПечать = "uk";
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	ПаспортФизЛица        = ОбщегоНазначения.ПаспортныеДанные(Шапка.ФизЛицо, Шапка.ДатаДокумента);
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента,,,КодЯзыкаПечать);

	ОбластьМакета = Макет.ПолучитьОбласть("ЛицеваяСторона");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	Если ВидОперации = Перечисления.ВидыОперацийДоверенность.Доверенность Тогда
		Если НазваниеМакета = "Доверенность" Тогда
			ОбластьМакета.Параметры.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(СсылкаНаОбъект);
		ИначеЕсли НазваниеМакета = "ДоверенностьБланк" Тогда
			ОбластьМакета.Параметры.Номер = "/" + ОбщегоНазначения.ПолучитьНомерНаПечать(СсылкаНаОбъект);
		КонецЕсли;
	КонецЕсли;
	
	КомуВыдана = ?(ЗначениеЗаполнено(ДолжностьДоверенного),ДолжностьДоверенного + " ","");
	ОбластьМакета.Параметры.КомуВыдана 						 = КомуВыдана + ФамилияИмяОтчествоДоверенного;
	ОбластьМакета.Параметры.НазваниеОрганизации		 		 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,", Ложь,КодЯзыкаПечать);
	Если Шапка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ОбластьМакета.Параметры.ЕДРПОУОрганизации	     		 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "КодПоЕДРПОУ,", Ложь,КодЯзыкаПечать);
	Иначе
		ОбластьМакета.Параметры.ЕДРПОУОрганизации	     		 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "КодПоДРФО,", Ложь,КодЯзыкаПечать);
	КонецЕсли;
	ОбластьМакета.Параметры.ЮридическийАдрес         		 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ЮридическийАдрес,", Ложь,КодЯзыкаПечать);
	Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.НомерРасчетногоСчетаОрганизации) Тогда
		ОбластьМакета.Параметры.НомерРасчетногоСчетаОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НомерСчета,", Ложь,КодЯзыкаПечать);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.МФОБанкаОрганизации) Тогда
		ОбластьМакета.Параметры.МФОБанкаОрганизации	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "МФО,", Ложь,КодЯзыкаПечать);
	КонецЕСли;
	Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.БанкОрганизации) Тогда
		ОбластьМакета.Параметры.БанкОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "Банк,", Ложь,КодЯзыкаПечать);
	КонецЕсли;
	
	ОбластьМакета.Параметры.ПодтверждающийДокументВид     	 = ПаспортФизЛица.Вид;
	ОбластьМакета.Параметры.ПодтверждающийДокументСерия      = ПаспортФизЛица.Серия;
	ОбластьМакета.Параметры.ПодтверждающийДокументНомер      = ПаспортФизЛица.Номер;
	ОбластьМакета.Параметры.ПодтверждающийДокументКемВыдан   = ПаспортФизЛица.Выдан;
	ОбластьМакета.Параметры.ПодтверждающийДокументДатаВыдачи = ПаспортФизЛица.ДатаВыдачи;
	ТабДокумент.Вывести(ОбластьМакета);

	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
    	
	ОбластьМакета = Макет.ПолучитьОбласть("ОбратнаяСторонаШапка");
	ТабДокумент.Вывести(ОбластьМакета);

	Если (НазваниеМакета = "ДоверенностьБланк") Тогда
		Если (ВыборкаСтрокТовары.Количество() > 6) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Сообщить("Количество строк в табличной части больше шести.Типовая форма М-2 ""Доверенность"" рассчитана на шесть строк!", СтатусСообщения.Важное);
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВысокая");
		КонецЕсли;
	Иначе 
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСПереносом");
	КонецЕсли;
	
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.КоличествоПрописью = ФормированиеПечатныхФорм.КоличествоПрописью(ВыборкаСтрокТовары.Количество, КодЯзыкаПечать);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	Если НазваниеМакета = "Доверенность" Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ОбратнаяСторонаПодвал");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;

	Возврат ТабДокумент;

КонецФункции
