
Процедура КПКолонки(Кнопка)
	Форма = ПолучитьФорму("РедакторКолонокРедактораТЗ");
	Форма.ТЗ = ТЗ;
	Форма.флТолькоПросмотр = ЭтаФорма.флТолькоПросмотр;
	Если Форма.ОткрытьМодально()=Истина Тогда
		ЭлементыФормы.ТЗ.СоздатьКолонки();
	КонецЕсли;
КонецПроцедуры

Процедура ОсновныеДействияФормыДействиеОК(Кнопка)
	Закрыть(Истина);
КонецПроцедуры

Процедура ПриОткрытии()
	ЭлементыФормы.ТЗ.СоздатьКолонки();
	ЭлементыФормы.ТЗ.ТолькоПросмотр = флТолькоПросмотр;
КонецПроцедуры

Процедура КПИзФайла(Кнопка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр="Файл данных (*.dat)|*.dat";
	Если Диалог.Выбрать() Тогда
		Попытка
			Выбор = ЗначениеИзФайла(Диалог.ПолноеИмяФайла);
		Исключение
			Возврат;
		КонецПопытки;
		Если ТипЗнч(Выбор)=Тип("ТаблицаЗначений") Тогда
			ТЗ = Выбор;
		КонецЕсли;
		ЭлементыФормы.ТЗ.СоздатьКолонки();
	КонецЕсли;
КонецПроцедуры

Процедура КПИзТабличногоДокумента(Кнопка)
	Выбор = ПолучитьФорму("ЗагрузкаТЗизExcel").ОткрытьМодально();
	Если ТипЗнч(Выбор)=Тип("ТаблицаЗначений") Тогда
		ТЗ = Выбор;
		ЭлементыФормы.ТЗ.СоздатьКолонки();
	КонецЕсли;
КонецПроцедуры
