
&НаКлиенте
Процедура УстановитьКомпактныйРежимФорм(Команда)
	УстановитьКомпактныйРежимФормНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьКомпактныйРежимФормНаСервере()
	
			РежимКомпактности = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
		  Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	    
	    Если Не Пользователь = Неопределено Тогда
	        
	        Настройка = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "",, Пользователь.Имя);
			
			Если Не ТипЗнч(Настройка) = Тип("НастройкиКлиентскогоПриложения") Тогда
	            Настройка = Новый НастройкиКлиентскогоПриложения;
	        КонецЕсли;
	        
	        Настройка.ВариантМасштабаФормКлиентскогоПриложения = РежимКомпактности;
	        ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", Настройка,, Пользователь.Имя);
	        Сообщить("Компактный режим форм установлен.Перезапустите конфигурацию 1с.");
	    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьАвтоРежимФорм(Команда)
	УстановитьАвтоРежимФормНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьАвтоРежимФормНаСервере()
			РежимКомпактности = ВариантМасштабаФормКлиентскогоПриложения.Авто;
		  Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	    
	    Если Не Пользователь = Неопределено Тогда
	        
	        Настройка = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "",, Пользователь.Имя);
			
			Если Не ТипЗнч(Настройка) = Тип("НастройкиКлиентскогоПриложения") Тогда
	            Настройка = Новый НастройкиКлиентскогоПриложения;
	        КонецЕсли;
	        
	        Настройка.ВариантМасштабаФормКлиентскогоПриложения = РежимКомпактности;
	        ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", Настройка,, Пользователь.Имя);
			
			Сообщить("Установлен автоматический режим форм. Перезапустите конфигурацию 1С.");
	    КонецЕсли;
КонецПроцедуры

