
// ++ Ситис: p.virich 0  2018-07-08
Функция ВыполнениеИнициализации()  Экспорт 
	
	Для Ном=1 По 100 Цикл
		
		СтрокаКоманды = "Действие"+Ном+"(Ложь, Версия);";
		Попытка  			 
			Версия = 0;
			Выполнить(СтрокаКоманды);
			//
			МенеджерЗаписи = РегистрыСведений.с_ВерсииВыполненнойИнициализации.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.НомерДействия = Ном;
			МенеджерЗаписи.Версия = Версия;
			МенеджерЗаписи.Записать();
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецФункции // -- Ситис: p.virich 0  2018-07-08 

// ++ Ситис: p.virich 0  2018-07-08
Процедура Действие1(ТолькоПроверка, ВозвращаемаяВерсия)
	
	ВозвращаемаяВерсия = 1;
	
	Если ТолькоПроверка Тогда
		Возврат
	КонецЕсли;
	
	//Выполнение действий
	
КонецПроцедуры   // -- Ситис: p.virich 0  2018-07-08

// ++ Ситис: p.virich 0  2018-07-08
Процедура Действие2(ТолькоПроверка, ВозвращаемаяВерсия)

	 ВозвращаемаяВерсия = 1;

	 Если ТолькоПроверка Тогда
	 		Возврат
		КонецЕсли;
		
		//Выполнение действий


 КонецПроцедуры   // -- Ситис: p.virich 0  2018-07-08
