Перем НП;

Процедура НачалоПериодаПриИзменении(Элемент)
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",НачалоПериода);
КонецПроцедуры

Процедура КонецПериодаПриИзменении(Элемент)
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода",КонецДня(КонецПериода));
КонецПроцедуры

Процедура ПриОткрытии()
	
	НачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода")).Значение;
	КонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода")).Значение;
	ВариантОтчета = 1;
	
	НП = Новый НастройкаПериода;
	НП.УстановитьПериод(НачалоПериода, КонецПериода);
	
КонецПроцедуры

Процедура ВариантОтчетаПриИзменении(Элемент)
	
	Если ВариантОтчета = 1 Тогда
		СхемаКомпоновкиДанных = ПолучитьМакет("БУ");
	ИначеЕсли ВариантОтчета = 2 Тогда
		СхемаКомпоновкиДанных = ПолучитьМакет("УУ");
	ИначеЕсли ВариантОтчета = 3 Тогда
		СхемаКомпоновкиДанных = ПолучитьМакет("НУ");
	Иначе
		Возврат
	КонецЕсли;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",НачалоПериода);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода",КонецПериода);
	
КонецПроцедуры

Процедура КнопкаНастройкаПериодаНажатие(Элемент)

	Если НП.Редактировать() Тогда
		
		НачалоПериода = НП.ПолучитьДатуНачала();
		КонецПериода = НП.ПолучитьДатуОкончания();
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",НачалоПериода);
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода",КонецДня(КонецПериода));

	КонецЕсли;

КонецПроцедуры	