Перем Схема;
Перем Расшифровка;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ПрочитатьТаблицуРолей();
КонецПроцедуры

Процедура КоманднаяПанельТаблицаРолейУстановитьФлажки(Кнопка)
	Для Каждого Стр из ТаблицаРолей Цикл
	    Стр.Пометка=Истина;
	КонецЦикла;
КонецПроцедуры

Процедура КоманднаяПанельТаблицаРолейСнятьФлажки(Кнопка)
	Для Каждого Стр из ТаблицаРолей Цикл
	    Стр.Пометка=Ложь;
	КонецЦикла;
КонецПроцедуры

Процедура КоманднаяПанельТаблицаРолейУстановитьПоПользователю(Кнопка)
	Сп=Новый СписокЗначений();
	Мас=ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого Стр из Мас Цикл
	    Сп.Добавить(Стр.УникальныйИдентификатор,?(СокрЛП(Стр.ПолноеИмя)="",Стр.Имя,Стр.ПолноеИмя));
	КонецЦикла;
	Сп.СортироватьПоПредставлению();
	
	Поль=Сп.ВыбратьЭлемент("Выбирите пользователя");
	Если Поль<>Неопределено Тогда
	    П=ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Поль.Значение);
	    ТаблицаРолей.ЗаполнитьЗначения(Ложь,"Пометка");
	    Для Каждого Стр из П.Роли Цикл
	        СтрокаР=ТаблицаРолей.Найти(Стр.Имя,"ИмяРоли");
	        СтрокаР.Пометка=Истина;
	    КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура КоманднаяПанель1Сформировать(Кнопка)
    ЭлементыФормы.Результат.Очистить();
	ПострМакета=Новый КомпоновщикМакетаКомпоновкиДанных();
	Макет=ПострМакета.Выполнить(Схема,КомпоновщикРоли.Настройки,Расшифровка);
	
	Проц=Новый ПроцессорКомпоновкиДанных();
	Проц.Инициализировать(Макет, Новый Структура("ТаблицаПрав",ПрочитатьСводнуюТаблицуПрав()),Расшифровка);
	
	Вывод=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	Вывод.УстановитьДокумент(ЭлементыФормы.Результат);
	Вывод.Вывести(Проц);
КонецПроцедуры

Процедура КоманднаяПанель1Настройка(Кнопка)
	Ф=ПолучитьФорму("ФормаОтчетПоРолямНастройки");
	СтарыеНастройки=КомпоновщикРоли.ПолучитьНастройки();
	Если НЕ (Ф.ОткрытьМодально()=Истина) Тогда
	    КомпоновщикРоли.ЗагрузитьНастройки(СтарыеНастройки);
	КонецЕсли;
КонецПроцедуры

Схема=ПолучитьМакет("МакетРоли");
КомпоновщикРоли.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
КомпоновщикРоли.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
Расшифровка=Новый ДанныеРасшифровкиКомпоновкиДанных();