
Процедура ПриОткрытии()
	
	ЭтаФорма.Заголовок						= ЭтотОбъект.Метаданные().Представление();
	
	Конфигурация 							= ПараметрыСеансаОбработки.Конфигурация + ", версия " + ПараметрыСеансаОбработки.Версия;
	КраткаяИнформация						= ПараметрыСеансаОбработки.КраткаяИнформация;
	РежимСовместимости						= ПараметрыСеансаОбработки.РежимСовместимости;
	ОсновнойРежимЗапуска 					= ПараметрыСеансаОбработки.ОсновнойРежимЗапуска;
	ТекущийРежимЗапуска 					= "" + ПараметрыСеансаОбработки.ТекущийРежимЗапуска + ": " + ПараметрыСеансаОбработки.ТонкийТолстый;
	БазаДанных								= ПараметрыСеансаОбработки.СтрокаСоединенияИнформационнойБазы;
	ИмяФайлаОбработки						= ПараметрыСеансаОбработки.ИмяФайлаОбработки;
	ТекущийПользовательИБ   				= ПараметрыСеансаОбработки.ТекущийПользовательИБ;
	ПравоАдминистрирование					= ПараметрыСеансаОбработки.ПравоАдминистрирование;
	ПолныеПрава								= ПараметрыСеансаОбработки.ПолныеПрава;
	ПривилегированныйРежим					= ПараметрыСеансаОбработки.ПривилегированныйРежим;
	ИмяРегистраДатыЗапрета					= ПараметрыСеансаОбработки.ИмяРегистраДатыЗапрета;

КонецПроцедуры

Процедура МонопольныйРежимПриИзменении(Элемент)
	
	Попытка
		УстановитьМонопольныйРежим(Элемент.Значение);
		Оповестить("МонопольныйРежим", МонопольныйРежим(), ЭтаФорма);
	Исключение
		Оповестить("МонопольныйРежим", МонопольныйРежим(), ЭтаФорма);
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		Возврат;
	КонецПопытки;
	
	Если МонопольныйРежим Тогда
		ПредупреждениеСообщение(, "УСТАНОВЛЕН МОНОПОЛЬНЫЙ РЕЖИМ.
		|
		|""Один пашет, а семеро руками машут."" (народная мудрость)");
	Иначе
		ПредупреждениеСообщение(, "УСТАНОВЛЕН МНОГОПОЛЬЗОВАТЕЛЬКИЙ ДОСТУП.
		|
		|""Один горюет, а артель воюет."" (народная мудрость)");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказыватьСообщенияПриИзменении(Элемент)
	
	Оповестить("ПоказыватьСообщения", ПоказыватьСообщения, ЭтаФорма);

	Если ПоказыватьСообщения Тогда
		ПредупреждениеСообщение(, "ПОКАЗЫВАТЬ СООБЩЕНИЯ.
		|
		|""Свой глаз - алмаз."" (народная мудрость)",, "УСТАНОВЛЕН РЕЖИМ:");
	Иначе	
		ПредупреждениеСообщение(, "НЕ ПОКАЗЫВАТЬ СООБЩЕНИЯ.
		|
		|""Не видит око и зуб неймет."" (~ народная мудрость)",, "УСТАНОВЛЕН РЕЖИМ:");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбменДаннымиЗагрузкаПриИзменении(Элемент)
	
	Оповестить("ОбменДаннымиЗагрузка", ОбменДаннымиЗагрузка, ЭтаФорма);
	
	Если ОбменДаннымиЗагрузка Тогда
		ПредупреждениеСообщение(, "ОТКЛЮЧИТЬ ТРИГГЕРЫ ЗАПИСИ (<Объект изменяемый>.ОбменДанными.Загрузка = Истина):
		|
		|1С: Если значение данного свойства Истина, 
		|то при выполнении записи или удаления данных будет производиться минимум проверок, 
		|так как при этом делается предположение, что производится запись данных, 
		|полученных через механизмы обмена данными, и эти данные корректны.
		|
		|Триггер (Trigger) - это особый вид хранимых процедур, автоматически выполняемых 
		|при исполнении оператора Update, Insert или Delete над данными таблицы.
		|
		|""Одна мудрая голова ста голов стоит."" (народная мудрость)",, "УСТАНОВЛЕН РЕЖИМ:");
	Иначе	
		ПредупреждениеСообщение(, "ВКЛЮЧИТЬ ТРИГГЕРЫ ЗАПИСИ (<Объект изменяемый>.ОбменДанными.Загрузка = Ложь):
		|
		|1С: Если значение данного свойства Истина, 
		|то при выполнении записи или удаления данных будет производиться минимум проверок, 
		|так как при этом делается предположение, что производится запись данных, 
		|полученных через механизмы обмена данными, и эти данные корректны.
		|
		|Триггер (Trigger) - это особый вид хранимых процедур, автоматически выполняемых 
		|при исполнении оператора Update, Insert или Delete над данными таблицы.
		|
		|""Одна голова хорошо, а две лучше."" (народная мудрость)",, "УСТАНОВЛЕН РЕЖИМ:");
	КонецЕсли;
	
КонецПроцедуры

Процедура СкрыватьПустыеТаблицыДвиженийРегистровПриИзменении(Элемент)
	
	Оповестить("СкрыватьПустыеТаблицыДвиженийРегистров", СкрыватьПустыеТаблицыДвиженийРегистров, ЭтаФорма);

	Если СкрыватьПустыеТаблицыДвиженийРегистров Тогда
		ПредупреждениеСообщение(, "НЕ ОТОБРАЖАТЬ ПУСТЫЕ ТАБЛИЦЫ ДВИЖЕНИЙ РЕГИСТРОВ.
		|
		|""С глаз долой - из сердца вон."" (народная мудрость)",, "УСТАНОВЛЕН РЕЖИМ:");
	Иначе	
		ПредупреждениеСообщение(, "ОТОБРАЖАТЬ ВСЕ ТАБЛИЦЫ ДВИЖЕНИЙ РЕГИСТРОВ (в т.ч. пустые).
		|
		|""Глаза боятся, а руки делают."" (народная мудрость)",, "УСТАНОВЛЕН РЕЖИМ:");
	КонецЕсли;
	
КонецПроцедуры

Процедура СкрыватьПустыеТабличныеЧастиПриИзменении(Элемент)
	
	Оповестить("СкрыватьПустыеТабличныеЧасти", СкрыватьПустыеТабличныеЧасти, ЭтаФорма);

	Если ЭтаФорма.СкрыватьПустыеТабличныеЧасти Тогда
		ПредупреждениеСообщение(, "НЕ ОТОБРАЖАТЬ ПУСТЫЕ ТАБЛИЧНЫЕ ЧАСТИ.
		|
		|""С глаз долой - из сердца вон."" (народная мудрость)",, "УСТАНОВЛЕН РЕЖИМ:");
	Иначе	
		ПредупреждениеСообщение(, "ОТОБРАЖАТЬ ВСЕ ТАБЛИЧНЫЕ ЧАСТИ (в т.ч. пустые).
		|
		|""Глаза боятся, а руки делают."" (народная мудрость)",, "УСТАНОВЛЕН РЕЖИМ:");
	КонецЕсли;
	
КонецПроцедуры

Процедура АдресНаИнфоСтартНажатие(Элемент)
		
	ЗапуститьПриложение("http://infostart.ru/public/100967/");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// МОДАЛЬНОЕ/НЕМОДАЛЬНОЕ ПРЕДУПРЕЖДЕНИЕ.
//

Функция ИспользоватьРежимМодальности()

	Возврат (ПараметрыСеансаОбработки.РежимИспользованияМодальности = "Использовать" ИЛИ ПараметрыСеансаОбработки.РежимИспользованияМодальности = "ИспользоватьСПредупреждениями");
	
КонецФункции

Процедура ПредупреждениеСообщение(ОписаниеОповещенияОЗавершении, ТекстПредупрежденияСообщения, Таймаут = 0, Заголовок = "")
	
	Если ИспользоватьРежимМодальности() Тогда
		Предупреждение(ТекстПредупрежденияСообщения, Таймаут, Заголовок);
	Иначе
		Выполнить("ПоказатьПредупреждение(ОписаниеОповещенияОЗавершении, ТекстПредупрежденияСообщения, Таймаут, Заголовок)");
	КонецЕсли;
		
КонецПроцедуры
