
Процедура ОтключитьГлавныйУзелНажатие(Кнопка)
    Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
        СохранитьЗначение("РеанимацияПодчиненногоУзла_ГлавныйУзел",ПланыОбмена.ГлавныйУзел());
    	ПланыОбмена.УстановитьГлавныйУзел(Неопределено);
    КонецЕсли;
    Предупреждение("Главный узел отключен");
КонецПроцедуры

Процедура ПодключитьГлавныйУзелНажатие(Элемент)
    Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
        Если Вопрос("Главный узел уже установлен как " + ПланыОбмена.ГлавныйУзел() + Символы.ПС + "Установить главным узлом другой?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
            Возврат;
        КонецЕсли;
    Иначе    
        пГлавныйУзел = ВосстановитьЗначение("РеанимацияПодчиненногоУзла_ГлавныйУзел");
    КонецЕсли;
    
	Если пГлавныйУзел = Неопределено Тогда
		мСписок = новый СписокЗначений;
		Для каждого плоб Из Метаданные.ПланыОбмена Цикл
		    мСписок.Добавить(плоб.Имя);
		КонецЦикла;
		пПланОбмена = ВыбратьИзСписка(мСписок);
		Если пПланОбмена = Неопределено Тогда
            Возврат;
        КонецЕсли;
        пГлавныйУзел = ПланыОбмена[пПланОбмена.Значение].ПолучитьФормуВыбора().ОткрытьМодально();
        Если пГлавныйУзел = Неопределено Тогда
            Возврат;
        КонецЕсли;
	КонецЕсли;
	Попытка
	    ПланыОбмена.УстановитьГлавныйУзел(пГлавныйУзел.Ссылка);
    	Предупреждение("Главный узел установлен как " + пГлавныйУзел);
	Исключение
	    Предупреждение("Ошибка установки главного узла ");
	КонецПопытки;
   
КонецПроцедуры

