
Процедура КнопкаВыполнитьНажатие(Кнопка)
	ЗаписатьТаблицуКонстант();
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	ЗаписатьТаблицуКонстант();
	Закрыть(Истина);
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ПрочитатьТаблицуКонстант();
КонецПроцедуры

Процедура ТаблицаКонстантПриАктивизацииСтроки(Элемент)
    ТекСтр=ЭлементыФормы.ТаблицаКонстант.ТекущаяСтрока;
    Если Текстр=Неопределено Тогда
        ЭлементыФормы.НадписьОписаниеКонстанты.Заголовок="";
    Иначе
		ЭлементыФормы.НадписьОписаниеКонстанты.Заголовок="Тип: "+Строка(ТипЗнч(ТекСтр.Значение));
	КонецЕсли;
КонецПроцедуры

Процедура ТаблицаКонстантПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если Элемент.ТекущаяКолонка.Имя="Значение" Тогда
		Элемент.ТекущаяКолонка.ЭлементУправления.ОграничениеТипа=Метаданные.Константы[Элемент.ТекущаяСтрока.Имя].Тип;
	КонецЕсли;
КонецПроцедуры

Процедура ТаблицаКонстантПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	ОформлениеСтроки.Ячейки.Имя.ОтображатьКартинку=Истина;
	ОформлениеСтроки.Ячейки.Имя.ИндексКартинки=0;
КонецПроцедуры
