Процедура ПрименитьИзмененияИЗакрытьФормуЛкс(ЭтаФорма, ЗначениеВыбора = Неопределено) Экспорт

	ЭтаФорма.Модифицированность = Ложь;
	Если Ложь
		Или ЭтаФорма.ВладелецФормы <> Неопределено 
		Или Не ЭтаФорма.Открыта()
	Тогда
		ЭтаФорма.ОповеститьОВыборе(ЗначениеВыбора);
	КонецЕсли;
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть(ЗначениеВыбора);
	КонецЕсли;
	//Если ЭтаФорма.Открыта() Тогда
	//	ЭтаФорма.Закрыть(ЗначениеВыбора);
	//Иначе//Если ЭтаФорма.МодальныйРежим Тогда
	//	ЭтаФорма.ОповеститьОВыборе(ЗначениеВыбора);
	//КонецЕсли; 

КонецПроцедуры // ПрименитьИзмененияИЗакрытьФорму()

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	НовоеЗначение = Новый Граница(РеквизитЗначение, РеквизитВидГраницы);
	ПрименитьИзмененияИЗакрытьФормуЛкс(ЭтаФорма, НовоеЗначение);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ТипЗнч(НачальноеЗначениеВыбора) <> Тип("Граница") Тогда
		НачальноеЗначениеВыбора = Новый Граница(ТекущаяДата(), ВидГраницы.Исключая);
	КонецЕсли;
	РеквизитЗначение = НачальноеЗначениеВыбора.Значение;
	РеквизитВидГраницы = НачальноеЗначениеВыбора.ВидГраницы;

КонецПроцедуры

СписокВыбора = ЭлементыФормы.ВидГраницы.СписокВыбора;
СписокВыбора.Добавить(ВидГраницы.Включая, "Включая");
СписокВыбора.Добавить(ВидГраницы.Исключая, "Исключая");