
Процедура КнопкаСформироватьНажатие(Кнопка)
	Отбор = Новый Структура;
	Отбор.Вставить("СпособОценкиСтоимости", Перечисления.СпособыОценкиСтоимостиВстречногоВыпуска.ПоРасчетнойСтоимости);
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Продукция КАК Продукция,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Затрата	КАК Затрата,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.Период	КАК ПериодРВВ,
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.СпособОценкиСтоимости КАК СпособОценкиСтоимости
	|ИЗ
	|	РегистрСведений.ВстречныйВыпускПродукцииУслуг.СрезПоследних(КОНЕЦПЕРИОДА(&Начало, МЕСЯЦ),  ) КАК ВстречныйВыпускПродукцииУслугСрезПоследних
	|ГДЕ
	|	ВстречныйВыпускПродукцииУслугСрезПоследних.СпособОценкиСтоимости = &Отбор
	|УПОРЯДОЧИТЬ ПО
	|	Продукция,
	|	Затрата
	|АВТОУПОРЯДОЧИВАНИЕ
	|";
	
	Запрос = новый Запрос(ТекстЗапроса);	
    Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Отбор", Перечисления.СпособыОценкиСтоимостиВстречногоВыпуска.ПоРасчетнойСтоимости);
    
	РегистрВВ = Запрос.Выполнить().Выгрузить();
	
	если РегистрВВ.Количество() = 0 тогда
		Предупреждение("Регистр ВВ пустой");
	конецЕсли;
	ЭтаФорма.ЭлементыФормы.эфРегистрВВ.СоздатьКолонки();
КонецПроцедуры