 
&НаКлиенте
Процедура ОбновитьДанныеСправочника(Команда)

	ОбновитьДанныеСправочникаНаСервере(истина, ложь);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбновитьДанныеСправочникаНаСервере(ЕстьИзменения, ЕстьУдаленные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника(ЕстьИзменения, ЕстьУдаленные);
	
	//Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника(истина, ложь);
	
КонецПроцедуры

