#Область ОбщиеКомандыФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаОтобранныеПроводки.Видимость = Элементы.ФормаКнопкаПоказатьПроводки.Пометка;
	Элементы.ГруппаНастройкиКомпоновщика.Видимость = Элементы.ФормаКнопкаПоказатьНастройки.Пометка;
	
	Отчет.ДатаДокумента = ТекущаяДата();
	Отчет.Комментарий = "Сторнировка проводок";
	
	Отчет.СтандартныйПериод.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Отчет.СтандартныйПериод.ДатаНачала = НачалоГода(ТекущаяДата());
	Отчет.СтандартныйПериод.ДатаОкончания = КонецДня(ТекущаяДата());
	
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", Отчет.СтандартныйПериод.ДатаНачала);
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(Отчет.СтандартныйПериод.ДатаОкончания));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьНастройки(Команда)
	Элементы.ФормаКнопкаПоказатьНастройки.Пометка = Не Элементы.ФормаКнопкаПоказатьНастройки.Пометка;
	Элементы.ГруппаНастройкиКомпоновщика.Видимость = Элементы.ФормаКнопкаПоказатьНастройки.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПроводки(Команда)
	Элементы.ФормаКнопкаПоказатьПроводки.Пометка = Не Элементы.ФормаКнопкаПоказатьПроводки.Пометка;
	Элементы.ГруппаОтобранныеПроводки.Видимость = Элементы.ФормаКнопкаПоказатьПроводки.Пометка;
КонецПроцедуры

&НаСервере
Процедура СтандартныйПериодПриИзмененииНаСервере()
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", Отчет.СтандартныйПериод.ДатаНачала);
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(Отчет.СтандартныйПериод.ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура СтандартныйПериодПриИзменении(Элемент)
	СтандартныйПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьСторноНаСервере()
	ОтчетОбъект		= РеквизитФормыВЗначение("Отчет");
	ДокументСсылка	= ОтчетОбъект.СоздатьДокументКорректировки();
	ТЗПроводки		= ОтчетОбъект.ПолучитьРезультатТаблицей();
	ОтчетОбъект.ЗагрузитьПроводкиВДокумент(ДокументСсылка, ТЗПроводки);
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.УстановитьДанные(ДокументСсылка);
	СообщениеПользователю.Текст = "Создан документ " + ДокументСсылка;
	СообщениеПользователю.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьСторно(Команда)
	КомандаСформироватьСторноНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОтобратьВТаблицуНаСервере()
	ОтчетОбъект		= РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ЗаполнитьТаблицуПроводок();
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобратьВТаблицу(Команда)
	КомандаОтобратьВТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьСторноПоТаблицеНаСервере()
	ОтчетОбъект		= РеквизитФормыВЗначение("Отчет");
	ДокументСсылка	= ОтчетОбъект.СоздатьДокументКорректировки();
	ТЗПроводки		= ОтчетОбъект.ПроводкиКСторнированию.Выгрузить(Новый Структура("Пометка", Истина));
	ОтчетОбъект.ЗагрузитьПроводкиВДокумент(ДокументСсылка, ТЗПроводки);
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.УстановитьДанные(ДокументСсылка);
	СообщениеПользователю.Текст = "Создан документ " + ДокументСсылка;
	СообщениеПользователю.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьСторноПоТаблице(Команда)
	КомандаСформироватьСторноПоТаблицеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область КомандныТаблицыПроводкиКСторнированию

&НаСервере
Процедура ИзменитьПометкиНаСервере(Значение)
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ПроводкиКСторнированиюУстановитьПометки(Значение);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьПометки(Команда)
	ИзменитьПометкиНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьПометки(Команда)
	ИзменитьПометкиНаСервере(Ложь);
КонецПроцедуры

#КонецОбласти